app/controllers/songs_controller.rb

  def create
    if song_params[:artist_name].blank?
      @song = Song.new(title: params[:title])
    else
      @song = Song.new(song_params)
    end

    if @song.save
---
INSERT INTO "songs" ("title", "artist_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Song 2"], ["artist_id", 1], ["created_at", "2016-01-27 00:20:14.516774"], ["updated_at", "2016-01-27 00:20:14.516774"]]

  def edit
    @song = Song.find(params[:id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def update
    @song = Song.find(params[:id])

    @song.update(song_params)
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "songs" SET "artist_id" = ?, "updated_at" = ? WHERE "songs"."id" = ?  [["artist_id", 3], ["updated_at", "2020-03-25 19:25:33.513261"], ["id", 3]]